___

<a href='https://www.cr4q.org/'> <img src='img/bb.png' /></a>
___

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [9]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [10]:
df = pd.DataFrame(data)

In [11]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [12]:
df.groupby('Company')

You can save this object as a new variable:

In [13]:
by_comp = df.groupby("Company")

And then call aggregate methods off the object:

In [14]:
by_comp.mean()

/tmp/ipykernel_98249/821838057.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [15]:
df.groupby('Company').mean()

/tmp/ipykernel_98249/2058252646.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [8]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [9]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [40]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [41]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [42]:
by_comp.describe()

                    Sales
Company
FB      count    2.000000
        mean   296.500000
        std     75.660426
        min    243.000000
        25%    269.750000
        50%    296.500000
        75%    323.250000
        max    350.000000
GOOG    count    2.000000
        mean   160.000000
        std     56.568542
        min    120.000000
        25%    140.000000
        50%    160.000000
        75%    180.000000
        max    200.000000
MSFT    count    2.000000
        mean   232.000000
        std    152.735065
        min    124.000000
        25%    178.000000
        50%    232.000000
        75%    286.000000
        max    340.000000

In [43]:
by_comp.describe().transpose()

Company    FB                                                         GOOG  \
        count   mean        std    min     25%    50%     75%    max count
Sales     2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0   2.0

Company         ...                  MSFT                                   \
          mean  ...      75%    max count   mean         std    min    25%
Sales    160.0  ...    180.0  200.0   2.0  232.0  152.735065  124.0  178.0

Company
           50%    75%    max
Sales    232.0  286.0  340.0

[1 rows x 24 columns]

In [7]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [16]:
# importing pandas as pd
import pandas as pd


# dictionary of lists
dict = {'First_Name': ["Aparna", "Pankaj", "Sudhir",
					"Geeku", "Anuj", "Aman",
					"Madhav", "Raj", "Shruti"],
		'Last_Name': ["Pandey", "Gupta", "Mishra",
					"Chopra", "Mishra", "Verma",
					"Sen", "Roy", "Agarwal"],
		'Email_ID': ["apandey@gmail.com", "pankaj@gmail.com",
					"sumishra23@gmail.com", "cgeeku@yahoo.com",
					"anuj24@gmail.com", "amanver@yahoo.com",
					"madhav1998@gmail.com", "rroy7@gmail.com",
					"sagarwal36@gmail.com"],
		'Degree': ["MBA", "BCA", "M.Tech", "MBA", "B.Sc",
				"B.Tech", "B.Tech", "MBA", "M.Tech"],
		'Score': [90, 40, 75, 98, 94, 90, 80, 90, 95]}

# creating dataframe
df = pd.DataFrame(dict)

print(df)

  First_Name Last_Name              Email_ID  Degree  Score
0     Aparna    Pandey     apandey@gmail.com     MBA     90
1     Pankaj     Gupta      pankaj@gmail.com     BCA     40
2     Sudhir    Mishra  sumishra23@gmail.com  M.Tech     75
3      Geeku    Chopra      cgeeku@yahoo.com     MBA     98
4       Anuj    Mishra      anuj24@gmail.com    B.Sc     94
5       Aman     Verma     amanver@yahoo.com  B.Tech     90
6     Madhav       Sen  madhav1998@gmail.com  B.Tech     80
7        Raj       Roy       rroy7@gmail.com     MBA     90
8     Shruti   Agarwal  sagarwal36@gmail.com  M.Tech     95

In [17]:
# creating a new dataframe by applying the required
# conditions in []
df1 = df[df['Score'] >= 80]

print(df1)

  First_Name Last_Name              Email_ID  Degree  Score
0     Aparna    Pandey     apandey@gmail.com     MBA     90
3      Geeku    Chopra      cgeeku@yahoo.com     MBA     98
4       Anuj    Mishra      anuj24@gmail.com    B.Sc     94
5       Aman     Verma     amanver@yahoo.com  B.Tech     90
6     Madhav       Sen  madhav1998@gmail.com  B.Tech     80
7        Raj       Roy       rroy7@gmail.com     MBA     90
8     Shruti   Agarwal  sagarwal36@gmail.com  M.Tech     95

In [18]:
# Creating on the basis of Last_Name
dfname = df[df['Last_Name'] == 'Mishra']

print(dfname)

  First_Name Last_Name              Email_ID  Degree  Score
2     Sudhir    Mishra  sumishra23@gmail.com  M.Tech     75
4       Anuj    Mishra      anuj24@gmail.com    B.Sc     94

In [22]:
# Creating another object using groupby
grouped2 = df.groupby('Score')

# the return type of the object 'grouped2' is
# pandas.core.groupby.generic.DataFrameGroupBy.

# Creating a dataframe from the object
# using get_group() dataframe of students
# with Score = 90
df_grouped2 = grouped2.get_group(90)

print(df_grouped2)

  First_Name Last_Name           Email_ID  Degree  Score
0     Aparna    Pandey  apandey@gmail.com     MBA     90
5       Aman     Verma  amanver@yahoo.com  B.Tech     90
7        Raj       Roy    rroy7@gmail.com     MBA     90

In [25]:
df[df.Last_Name.isin(['Mishra','Pandey'])]['Score']

0    90
2    75
4    94
Name: Score, dtype: int64

In [27]:
df[df.Degree.str.startswith('J')]

Empty DataFrame
Columns: [First_Name, Last_Name, Email_ID, Degree, Score]
Index: []

In [40]:
df.query('Last_Name == ["Pandey", "Mishra"]')['Score']

0    90
2    75
4    94
Name: Score, dtype: int64

# Great Job!